# 3주차 2차시

In [2]:
import pandas as pd

### 데이터 추출
#### (4) 슬라이싱: range적용한 슬라이싱

In [4]:
df = pd.read_csv('gapminder.tsv',sep='\t')

In [5]:
df.iloc[(list(range(0,6,2)))]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [8]:
df[list(range(0,6,2))]

KeyError: "None of [Int64Index([0, 2, 4], dtype='int64')] are in the [columns]"

### **짝수 열 추출하는 법!!**

In [12]:
cc= list(range(0,6,2))
cc

[0, 2, 4]

In [11]:
df.iloc[0:3, cc]

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083

In [16]:
df.iloc[:, 0:6:2]

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [17]:
df.iloc[0:6:2, :]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [18]:
df.iloc[0:3,0:6:2]

       country  year       pop
0  Afghanistan  1952   8425333
1  Afghanistan  1957   9240934
2  Afghanistan  1962  10267083

#### **iloc 과 loc의 결과값이 다른 것을 주의!!**

In [20]:
df.iloc[0:6:2,:]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [21]:
df.loc[0:6:2,:]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
6  Afghanistan      Asia  1982   39.854  12881816  978.011439

#### **행열 추출계산을 range에게 맡긴 뒤 적용추출 시에는 결과값이 동일하다!!**

In [28]:
list(range(6))

[0, 1, 2, 3, 4, 5]

In [23]:
df.iloc[list(range(6)),:]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
5  Afghanistan      Asia  1977   38.438  14880372  786.113360

In [24]:
df.loc[list(range(6)),:]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
5  Afghanistan      Asia  1977   38.438  14880372  786.113360

In [29]:
list(range(0,6,3))

[0, 3]

In [30]:
df.iloc[list(range(0,6,3)), : ]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
3  Afghanistan      Asia  1967   34.020  11537966  836.197138

In [31]:
df.loc[list(range(0,6,3)), : ]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
3  Afghanistan      Asia  1967   34.020  11537966  836.197138

* index가 정수일때, loc 가능하다!

 ### **중요** 넘파이는 리스트보다 처리속도가 빠르고 메모리도 효율적이다!